{
    "menu": "Menu",
    "settings": "Settings",
    "home": "Home",
    "experience": "Work experience",
    "education": "Education",
    "language": "Language",
    "en": "English",
    "theme": "Theme",
    "light": "light",
    "dark": "dark",
    "skills": "Skills",
    "projects": "Personal projects",
    "contact": "Contact",
    "header": "Eliot Blanco Lebrero, software developer",
    "hello": "Hello, my name is Eliot and welcome to my web page",
    "myself": "I am a software developer from Spain and I did this page to show my CV and my front end programming skills.",
    "vscode": "As you can see, I tried to imitate the layout and some of the functionalities of Visual Studio Code, one of the main IDEs I use at work as well as at home. Therefore, this web is not meant to be open in a mobile device.",
    "present": "Present",
    "note": "Note:",
    "full_stack": "Full stack developer",
    "bnp": "BNP Paribas Securities Services, Lisbon (Portugal)",
    "bnp1": "Development and maintenance of several modules of a big application used in the bank. The main technologies used are Angular, Spring Boot, Gradle, Sybase and OpenAPI and for the continuous integration part it is used – but not managed by the development team – Kubernetes, Jenkins, Fortify, NexusIQ and SonarQube among others. The methodology used is inspired by Scrum and Kanban. The development team is distributed between France and Portugal.",
    "consultant_sw_engineer": "Consultant/Software Engineer",
    "agap2": "agap2IT, Lisbon (Portugal)",
    "agap21": "Software engineering consultacy for BNP Paribas Securities Services. More details in the chronologically following position, since it is a continuation of this one.",
    "altran": "Altran, Lisbon (Portugal)",
    "altran1": "Software engineering consultacy for KLx (part of Crédit Agricole group).",
    "akka": "Akka Technologies, Lyon (France)",
    "akka1": "Development of a web server from scratch, using Python, connected to a proof of concept of an autonomous car which retrieves data from its sensors. Its purpose is to serve this data to a later development of a web interface to display it in a human friendly way.",
    "akka2": "Development of a web platform from scratch for the management of the projects’ data of one of the departments of the company, developed using Angular and Angular Material in the front end, and Node.js, Express and TypeScript in the back end. The database is in MySQL. The methodology used for this project is Scrum in a distributed team.",
    "akka3": "Development of a software for the client Acore that communicates with a PLC which controls rectifiers. The software is developed in C# using WPF and Entity Framework with MySQL.",
    "akka_note": "Before starting to work in Lyon, I spent a month (the month of August) in a training program called The Akkademy and conducted by Akka Switzerland in Geneva. The training consisted in the improvement soft skills with around 70 people from different parts of Europe and the working language was English. After that month, I was sent to Akka France in Lyon with several of my colleagues from Geneva.",
    "sw_engineer": "Software Engineer",
    "imatia": "Imatia Innovation, Ourense (Spain)",
    "imatia1": "Development and maintenance of a web based (SPA) logistics management application for Inditex. In the front end, this application uses mainly vanilla JavaScript with some jQuery (DOM manipulations, promise handling and communication with the back end REST API), Underscore (templates) and Backbone (routing), using also the IndexedDB API for storing temporary data. In the back end, this application uses Spring for the REST API endpoints as well as for the dependency injection manager, using complex SQL sentences in the database (DB2) layer for retrieving and adding data. This project was developed using the Scrum methodology mixed with some Kanban in a distributed team.",
    "junior": "Junior programmer",
    "plexus": "Tecnologías Plexus, Ourense (Spain)",
    "plexus1": "Software maintenance for Barceló Viajes.",
    "sw_engineer_rd": "Software Engineer",
    "redegal": "Redegal, Ourense (Spain)",
    "redegal1": "Development of a customer clustering system for PrestaShop CMS using Spark MLlib.",
    "redegal2": "Development of the web interface of a route optimization system for garbage collection services, using AngularJS and LeafletJS in the front end, Node.js in the back end and an OSRM server.",
    "intern": "IT intern",
    "bueu": "Concello de Bueu, Bueu (Spain)",
    "bueu1": "System administration in the Town Hall and the Police Department.",
    "bachelor": "Bachelor’s Degree, Computer Science",
    "uvigo": "Universidade de Vigo, Campus de Ourense, Ourense (Spain)",
    "associate": "Associate’s Degree, Information Technology",
    "rodeira": "IES de Rodeira, Cangas do Morrazo (Spain)",
    "courses": "Courses and certificates",
    "angular": "Angular 6 beginner course",
    "vitae": "Vitae Consultores, A Coruña (Spain)",
    "scrum": "Scrum course with Scrum Manager Expert certificate",
    "toeic": "TOEIC B2 English certificate",
    "multimedia": "Multimedia School, Ourense (Spain)",
    "technologies": "Technologies"
}
