{
    "menu": "Menu",
    "settings": "Settings",
    "home": "Home",
    "experience": "Work experience",
    "education": "Education",
    "language": "Language",
    "en": "English",
    "theme": "Theme",
    "light": "light",
    "dark": "dark",
    "skills": "Skills",
    "projects": "Personal projects",
    "contact": "Contact",
    "header": "Software developer",
    "hello": "Hello, my name is Eliot and welcome to my web page",
    "myself": "I am a Spanish software developer and I did this page to show my CV and my front end programming skills.",
    "cvscode_technologies": "This page is made with React, i18next and Vite.",
    "vscode": "As you can see, I tried to imitate the design, the layout and some of the functionalities of Visual Studio Code, one of the main IDEs I use at work as well as at home. Therefore, this web is not made to be opened in a mobile device.",
    "present": "Present",
    "note": "Note:",
    "full_stack": "Full Stack Developer",
    "bnp": "BNP Paribas Securities Services, Lisbon (Portugal)",
    "bnp0": "Continuation of the responsibilities of the previous experience in Agap2IT but as internal staff.",
    "consultant_sw_engineer": "Consultant/Software Engineer",
    "agap2": "agap2IT, Lisbon (Portugal)",
    "agap20": "Full stack development for BNP Paribas Securities Services. Development of business web tools using frameworks and technologies developed by the company, based on Spring Boot, Angular and SQL. Other technologies used: JasperReports, Jenkins, SonarQube, Jira.",
    "altran": "Altran, Lisbon (Portugal)",
    "altran0": "Software engineering consultancy for KLx (part of Crédit Agricole group).",
    "akka": "Akka Technologies, Lyon (France)",
    "akka0": "Development of a web server from scratch, using Python, connected to a proof of concept of an autonomous car which retrieves data from its sensors. Its purpose is to serve this data to a later development of a web interface to display it in a human friendly way.",
    "akka1": "Development of a web platform from scratch for the management of the projects' data of one of the departments of the company, developed in Angular in the front end using Angular Material, and developed in Node.js and Express in the back end using TypeScript. The database is in MySQL. The methodology for this project is Scrum in a distributed team.",
    "akka2": "Development of a software for the client Acore that communicates with a PLC which controls rectifiers. The software is developed in C# using WPF and Entity Framework with MySQL.",
    "akka_note": "Before starting to work in Lyon, I spent a month (the month of August) in a training program called The Akkademy and conducted by Akka Switzerland in Geneva. The training consisted in the improvement soft skills with around 70 people from different parts of Europe and the working language was English. After that month, I was sent to Akka France in Lyon with several of my colleagues from Geneva.",
    "sw_engineer": "Software Engineer",
    "imatia": "Imatia Innovation, Ourense (Spain)",
    "imatia0": "Development and maintenance of a web based (SPA) logistics management application for Inditex. For the front end, this application uses mainly vanilla JavaScript with some jQuery (DOM manipulations, promise handling and communication with the back end REST API), Underscore (templates) and Backbone (routing), using also the IndexedDB API for storing temporary data. For the back end, this application uses Spring for the REST API endpoints as well as for the dependency injection manager, using complex SQL sentences in the database (DB2) layer for retrieving and adding data. This project was developed using the Scrum methodology mixed with some Kanban in a distributed team.",
    "junior": "Junior programmer",
    "plexus": "Tecnologías Plexus, Ourense (Spain)",
    "plexus0": "Software maintenance for Barceló Viajes.",
    "sw_engineer_rd": "Software Engineer at R&D department",
    "redegal": "Redegal, Ourense (Spain)",
    "redegal0": "Development of a customer clustering system for PrestaShop CMS using Spark MLlib.",
    "redegal1": "Development of the web interface of a route optimization system for garbage collection services, with the front end written using AngularJS and LeafletJS and the back end using NodeJS and an OSRM server.",
    "intern": "System Admin Intern",
    "bueu": "Concello de Bueu, Bueu (Spain)",
    "bueu0": "System administration in the town Council and the Police Department.",
    "bachelor": "Bachelor’s Degree, Computer Science",
    "uvigo": "Universidade de Vigo, Campus de Ourense, Ourense (Spain)",
    "associate": "Associate’s Degree, Information Technology",
    "rodeira": "IES de Rodeira, Cangas do Morrazo (Spain)",
    "courses": "Courses and certificates",
    "angular": "Angular 6 beginner course",
    "vitae": "Vitae Consultores, A Coruña (Spain)",
    "scrum": "Scrum course with Scrum Manager Expert certificate",
    "toeic": "TOEIC B2 English certificate",
    "multimedia": "Multimedia School, Ourense (Spain)",
    "technical": "Technical skills",
    "programming": "Programming",
    "front_end": "Front end",
    "languages": "Languages",
    "frameworks_libraries": "Frameworks and libraries",
    "back_end": "Back end",
    "transversal": "Transversal",
    "methodologies": "Methodologies",
    "spanish": "Spanish: ★★★★★★",
    "galician": "Galician: ★★★★★★",
    "english": "English: ★★★★★☆",
    "portuguese": "Porguguese: ★★★★★☆",
    "french": "French: ★★★☆☆☆",
    "polish": "Polish: ★★☆☆☆☆",
    "finnish": "Finnish: ★☆☆☆☆☆",
    "page": "Page:",
    "code": "Code:",
    "screenshots": "Screenshots",
    "video": "Video",
    "oppi_header": "Web app for practicing word inflection in Finnish",
    "oppi0": "Oppi is a web app that I made to improve my experience learning how to inflect words in Finnish. It is developed in Angular and it uses the IndexedDB to store data.",
    "oppi1": "The way it works is simple: first you search for a word in the search input and then the app generates a table that you have to fill. After doing it, you press the check button and the app highlights the words you entered right and wrong in different colors. It also has the option to see the word inflection directly and the option of getting a random word. It has a tutorial explaining better how it works inside the app that is shown the first time that is used.",
    "oppi2": "I made it a PWA so you can have it on your phone as it was a native app. As it doesn't have a back end to get the words (it is hosted in GitHub Pages), it needs to have all the words in advance to work. To do so, the first time it loads on the browser, it downloads a file with about 58000 words that I extracted from Wiktionary using a Python script, and it stores these words in the IndexedDB, therefore it doesn't have to download them again each time it is used. Taking that in account, the first time it loads it needs some seconds to do it, so be patient.",
    "piollo_header": "Web client for the Raspberry Pi camera module",
    "piollo0": "Piollo is a web client for the Raspberry Pi camera module that uses web sockets to stream video. The front end is developed in AngularJS, anthough I want to change it to another technology in the future, and the back end is developed from scratch in Python using the picamera Python module. I didn't use any web framework because I found interesting doing it by myself to learn how to use sockets in this language.",
    "serkis": "keypointextractor and serkisplugin",
    "serkis_header": "Facial movement tracking and a 3D model rigging in Blender",
    "serkis0": "This is my Bachelor's Degree final project. It consists in two subprojects: the first one, keypointextractor, is a program that extracts facial keypoints from a video and the second one, serkisplugin, is a plugin for Blender that uses those extracted keypoints to animate a 3D model of a face.",
    "serkis1": "For this project, I've used Python with the libraries dlib, OpenCV and Qt for keypointextractor and Python with the Blender API for serkisplugin.",
    "grissonne_header": "Web version of Carcassonne",
    "grissonne0": "Web version of Carcassonne, a popular board game, made with the goal of learning React. It is meant to be played in big screens, it is not designed to be opened in mobile devices.",
    "new": "New!",
    "cvscode_modal": "I've made a new version of my web CV imitating vscode style, it is called CVscode. It is designed to be opened in desktop browsers, so if you are on desktop, consider checking it out.",
    "cvscode_open": "Go to CVscode",
    "stay_here": "Stay here",
    "go_to_cvscode": "Go to CVscode, the new version of this web",
    "cvscode": "CVscode",
    "cvscode_header": "My web CV in vscode style",
    "cvscode0": "It is made in React and it has some of the components of the vscode, like the tabs and the file explorer. It is still in progress, I plan to add more things in the future.",
    "warning": "Warning",
    "warning_mobile": "This page is not designed to be displayed in a mobile device, it should be opened in a desktop browser.",
    "go_mobile": "Go to mobile version",
    "gym": "Gym",
    "gym_header": "Web app for keeping track of workout routines",
    "gym0": "Gym is a web app that I made to keep track of my workout routine. It is developed in Angular and it uses the IndexedDB to store data and the service worker to control timers and notifications.",
    "gym1": "You can define workouts with exercises and execute them, with timers for the resting time. It also has a stopwatch and a global timer.",
    "gym2": "It is designed to be used on mobile devices and it can be installed as PWA."
}
