{
    "menu": "Menú",
    "settings": "Axustes",
    "home": "Inicio",
    "experience": "Experiencia profesional",
    "education": "Educación",
    "language": "Idioma",
    "gl": "galego",
    "theme": "Tema",
    "light": "claro",
    "dark": "escuro",
    "skills": "Habilidades",
    "projects": "Proxectos persoais",
    "contact": "Contacto",
    "header": "Desenvolvedor de software",
    "hello": "Ola, o meu nome é Eliot e douche a benvida á miña páxina web",
    "myself": "Son un desenvolvedor web español e fixen esta páxina para mostrar o meu CV e as miñas habilidades de programación de front end.",
    "cvscode_technologies": "Esta páxina está feita con React, i18next e Vite.",
    "vscode": "Como podes ver, tentei imitar o deseño, a distribución e algunhas das funcionalidades de Visual Studio Code, un dos principais IDEs que uso en el traballo así como en casa. Por tanto, esta web non está feita para ser aberta nun dispositivo móbil.",
    "present": "Presente",
    "note": "Nota:",
    "full_stack": "Desenvolvedor full stack",
    "bnp": "BNP Paribas Securities Services, Lisboa (Portugal)",
    "bnp0": "Continuación das responsabilidades da experiencia anterior en Agap2IT pero como traballador interno.",
    "consultant_sw_engineer": "Consultor/enxeñeiro de software",
    "agap2": "agap2IT, Lisboa (Portugal)",
    "agap20": "Desenvolvedor full stack para BNP Paribas Securities Services. Desenvolvemento de ferramentas web de negocio usando frameworks e outras tecnoloxías desenvolvidas pola empresa, baseadas en Spring Boot, Angular e SQL. Outras tecnoloxías usadas: JasperReports, Jenkins, SonarQube, Jira.",
    "altran": "Altran, Lisboa (Portugal)",
    "altran0": "Consultoría de enxeñería de software para KLx (parte do grupo Crédit Agricole).",
    "akka": "Akka Technologies, Lión (Francia)",
    "akka0": "Desenvolvemento dun servidor web desde cero, usando Python, conectado a unha proba de concepto dun coche autónomo que envía datos dos seus sensores. O seu propósito é servir eses datos a unha implementación posterior dunha interface web para mostralos dunha maneira máis lexible para o ser humano.",
    "akka1": "Desenvolvemento dunha plataforma web desde cero para a xestión dos datos dos proxectos dun dos departamentos da empresa, desenvolvida usando Angular e Angular Material no front end, e Node.js, Express e TypeScript no back end. A base de datos utilizada é en MySQL. A metodoloxía para este proxecto é Scrum nun equipo distribuído.",
    "akka2": "Desenvolvemento dun programa para o cliente Acore que se comunica cun PLC que controla rectificadores. O programa está desenvolvido en C# empregando WPF e Entity Framework con MySQL.",
    "akka_note": "Antes de comezar a traballar en Lión, estiven durante un mes (o mes de agosto) nun programa de formación chamado The Akkademy e levado a cabo por Akka Suíza en Xenebra. A formación consistía na mellora de soft skills con ó redor de 70 persoas de diferentes partes de Europa e a lingua de traballo foi o inglés. Despois dese mes, enviáronme a Akka Francia en Lión con vairos dos meus compañeiros de Xenebra.",
    "sw_engineer": "Enxeñeiro de software",
    "imatia": "Imatia Innovation, Ourense (España)",
    "imatia0": "Desenvolvemento e mantemento dunha aplicación web (SPA) de xestión loxística para Inditex. No front end, esta aplicación usa JavaScript puro con algo de jQuery (manipulación do DOM, manexo de promesas e comunicación coa API REST do back end), Underscore (templates) e Backbone (routing), usando tamén a API de IndexedDB para almacenar datos temporais. No back end, esta aplicación usa Spring para a API rest así como para o xestor de inxección de dependencias, utilizando sentencias SQL complexas na capa da base de datos (DB2) para consultar e engadir datos. Este proxecto está desenvolvido coa metodoloxía Scrum mesturada con un pouco de Kanban nun equipo distribuído.",
    "junior": "Programador junior",
    "plexus": "Tecnologías Plexus, Ourense (España)",
    "plexus0": "Mantemento de software para Barceló Viajes.",
    "sw_engineer_rd": "Enxeñeiro de software no departamento de I+D",
    "redegal": "Redegal, Ourense (España)",
    "redegal0": "Desenvolvemento dun sistema de clustering de clientes para o CMS PrestaShop usando Spark MLlib.",
    "redegal1": "Desenvolvemento dunha interface web dun sistema de optimización de rutas para servizos de recollida de lixo, usando AngularJS e LeafletJS no front end, Node.js no back end e un servidor OSRM.",
    "intern": "Prácticas de administrador de sistemas",
    "bueu": "Concello de Bueu, Bueu (España)",
    "bueu0": "Administrador de sistemas no Concello e na Policía Local.",
    "bachelor": "Grao en Enxeñaría Informática",
    "uvigo": "Universidade de Vigo, Campus de Ourense, Ourense (España)",
    "associate": "Técnico Superior en Administración de Sistemas Informáticos en Rede",
    "rodeira": "IES de Rodeira, Cangas do Morrazo (España)",
    "courses": "Cursos e certificacións",
    "angular": "Curso de iniciación a Angular 6",
    "vitae": "Vitae Consultores, A Coruña (España)",
    "scrum": "Curso de Scrum con certificado Scrum Manager Expert",
    "toeic": "Certificado de inglés TOEIC B2",
    "multimedia": "Multimedia School, Ourense (España)",
    "technical": "Habilidades técnicas",
    "programming": "Programación",
    "front_end": "Front end",
    "languages": "Idiomas",
    "frameworks_libraries": "Frameworks e bibliotecas",
    "back_end": "Back end",
    "transversal": "Transversal",
    "methodologies": "Metodoloxías",
    "spanish": "Español: ★★★★★★",
    "galician": "Galego: ★★★★★★",
    "english": "Inglés: ★★★★★☆",
    "portuguese": "Portugués: ★★★★★☆",
    "french": "Francés: ★★★☆☆☆",
    "polish": "Polaco: ★★☆☆☆☆",
    "finnish": "Finés: ★☆☆☆☆☆",
    "page": "Páxina:",
    "code": "Código:",
    "screenshots": "Capturas de pantalla",
    "video": "Vídeo",
    "oppi_header": "App web para practicar a flexión de palabras en finés",
    "oppi0": "Oppi é unha web app que fixen para mellorar a miña experiencia de aprendizaxe da flexión das palabras en finés. Está desenvolvida en Angular e usa a IndexedDB para almacenar datos.",
    "oppi1": "O funcionamento é simple: primeiro búscase unha palabra no input de busca e despois a app xera unha táboa que hai que encher. Despois de facelo, prémese o botón de chequear e a app resalta as palabras que se meteron ben e mal con cores diferentes. Tamén ten a opción de ver a flexión da palabra directamente e a opción de obter unha palabra aleatoria. Ten un tutorial explicando mellor como funciona dentro da app que se mostra a primeira vez que se usa.",
    "oppi2": "A fixen PWA para que poida terse no teléfono coma se fose unha app nativa. Como non ten back end para traer as palabras (está hosteado en GitHub Pages), necesita ter todas as palabras de antemán para funcionar. Para facer iso, a primeira vez que se carga no navegador, báixase un ficheiro con ó redor de 58000 palabras que extraín do Wiktionary empregando un script en Python, e garda esas palabras na IndexedDB, entón non ten que baixalas de novo cada vez que se usa. Tendo isto en conta, a primeira vez que carga necesita varios segundos para facelo, polo que hai que ser paciente.",
    "piollo_header": "Cliente web para o módulo da cámara da Raspberry Pi",
    "piollo0": "Piollo é un cliente web para o módulo da cámara da Raspberry Pi que emprega web sockets para streamear vídeo. O front end está desenvolvido en AngularJS, aínda que quero cambialo por outra tecnoloxía no futuro, e o back end está desenvolvido desde cero en Python empregando o módulo picamera de Python. Non utilicei ningún framework web porque me parecía interesante facelo por min mesmo para aprender como usar sockets nesta linguaxe.",
    "serkis": "keypointextractor e serkisplugin",
    "serkis_header": "Tracking de movementos faciais e control do movemento dun modelo 3D en Blender",
    "serkis0": "Este é o meu proxecto de fin de grao. Consiste en dous subproxectos: o primeiro, keypointextractor, é un programa que extrae puntos clave faciais dun vídeo e o segundo, serkisplugin, é un plugin para Blender que usa os puntos extraídos para animar un modelo 3D dunha cara.",
    "serkis1": "Para este proxecto, utilicei Python coas bibliotecas dlib, OpenCV e Qt para keypointextractor e Python coa API de Blender para serkisplugin.",
    "grissonne_header": "Versión web do Carcassonne",
    "grissonne0": "Versión web do Carcassonne, un popular xogo de mesa, feito co obxectivo de aprender React. Está pensado para ser xogado en pantallas grandes, non está deseñado para ser aberto en dispositivos móbiles.",
    "new": "Novo!",
    "cvscode_modal": "Fixen unha nova versión do meu CV web imitando o estilo do vscode, chámase CVscode. Está deseñado para abrirse en navegadores de escritorio, así que se estás en escritorio, considera botarlle unha ollada.",
    "cvscode_open": "Ir a CVscode",
    "stay_here": "Quedar aquí",
    "go_to_cvscode": "Ir a CVscode, a nova versión desta web",
    "cvscode": "CVscode",
    "cvscode_header": "O meu CV web no estilo do vscode",
    "cvscode0": "Está feito en React e ten algúns dos componentes do vscode, como as pestanas ou o explorador de arquivos. Está aínda sen terminar, teño pensado engadir máis coisas no futuro.",
    "warning": "Aviso",
    "warning_mobile": "Esta páxina non foi deseñada para ser mostrada nun dispositivo móbil, devería abrirse nun navegador de escritorio.",
    "go_mobile": "Ir á versión móbil"
}
