{
    "menu": "Menu",
    "settings": "Definições",
    "home": "Início",
    "experience": "Experiência profissional",
    "education": "Educação",
    "language": "Idioma",
    "pt": "português",
    "theme": "Tema",
    "light": "claro",
    "dark": "escuro",
    "skills": "Competências",
    "projects": "Projectos pessoais",
    "contact": "Contacto",
    "header": "Desenvolvedor de software",
    "hello": "Olá, o meu nome é Eliot e dou-te a bem-vinda à minha página web",
    "myself": "Sou un desenvolvedor web espanhol e criei esta página para mostrar o meu CV e as minhas competências de programação front end.",
    "cvscode_technologies": "Esta página é feita com React, i18next e Vite.",
    "vscode": "Como podes ver, tentei imitar o design, o layout e algumas das funcionalidades do Visual Studio Code, um dos principais IDEs que utilizo tanto no traballo como em casa. Por isso, esta web não foi feita para ser aberta nun dispositivo móvel.",
    "present": "Presente",
    "note": "Nota:",
    "full_stack": "Desenvolvedor full stack",
    "bnp": "BNP Paribas Securities Services, Lisboa (Portugal)",
    "bnp0": "Continuação das responsabilidades da experiência anterior em Agap2IT mas como trabalhador interno.",
    "consultant_sw_engineer": "Consultor/engenheiro de software",
    "agap2": "agap2IT, Lisboa (Portugal)",
    "agap20": "Desenvolvedor full stack para o BNP Paribas Securities Services. Desenvolvimento de ferramentas web de negócio utilizando frameworks e outras tecnologias desenvolvidas pela empresa, baseadas em Spring Boot, Angular e SQL. Outras tecnologias utilizadas: JasperReports, Jenkins, SonarQube, Jira.",
    "altran": "Altran, Lisboa (Portugal)",
    "altran0": "Consultoria de engenharia de software para a KLx (parte do grupo Crédit Agricole).",
    "akka": "Akka Technologies, Lyon (França)",
    "akka0": "Desenvolvimento de um servidor web de raiz, usando Python, ligado a uma prova de conceito de um carro autónomo que envia dados dos seus sensores. O seu objectivo é fornecer esses dados a uma implementaçãon posterior de uma interface web para os apresentar de uma forma mais legível para o ser humano.",
    "akka1": "Desenvolvimento de uma plataforma web de raiz para gerir os dados dos projetos de um dos departamentos da empresa, desenvolvida com Angular e Angular Material no front end, e Node.js, Express e TypeScript no back end. La base de dados utilizada é o MySQL. A metodologia para este projeto é Scrum numa equipa distribuída.",
    "akka2": "Desenvolvimento de um programa para el cliente Acore que comunica com um PLC que controla retificadores. O programa é desenvolvido em C# usando WPF e Entity Framework com MySQL.",
    "akka_note": "Antes de começar a trabalhar em Lyon, passei um mês (o mês de agosto) num programa de formação chamado The Akkadey e dirigido pela Akka Suíça em Genebra. La formação consistia no melhoramento de soft skills com cerca de 70 pessoas de diferentes partes da Europa e a língua de trabajo era o inglês. Depois desse mês, fui enviado para a Akka França em Lyon con vários dos meus colegas de Genebra.",
    "sw_engineer": "Engenheiro de software",
    "imatia": "Imatia Innovation, Ourense (Espanha)",
    "imatia0": "Desenvolvimento e manutenção de uma aplicação web (SPA) de gestão logística para a Inditex. No front end, esta aplicação utiliza Vanilla JavaScript com um pouco de jQuery (manipulações do DOM, tratamento de promessas e comunicação com a API REST do back end), Underscore (templates) e Backbone (routing), utilizando também a API de IndexedDB para armacenar dados temporários. No back end, esta aplicação utiliza Spring para a API REST, bem como para o gestor de injeção de dependências, utilizando declarações SQL complexas na base de datos (DB2) para obter e adicionar dados. Este projeto é desenvolvido com a metodologia Scrum misturada com um pouco de Kanban numa equipa distribuída.",
    "junior": "Programador junior",
    "plexus": "Tecnologías Plexus, Ourense (Espanha)",
    "plexus0": "Manutenção de software para Barceló Viajes.",
    "sw_engineer_rd": "Engenheiro de software no departamento de I&D",
    "redegal": "Redegal, Ourense (Espanha)",
    "redegal0": "Desenvolvimento de um sistema de clustering de clientes para o CMS PrestaShop utilizando Spark MLlib.",
    "redegal1": "Desenvolvimento de uma interface web para um sistema de optimização de rotas para serviços de recolha de lixo, utilizando AngularJS e LeafletJS no front end, Node.js no back end e um servidor OSRM.",
    "intern": "Estágio de administrador de sistemas",
    "bueu": "Concello de Bueu, Bueu (Espanha)",
    "bueu0": "Administrador de sistemas na Câmara Municipal e a Polícia.",
    "bachelor": "Licenciatura em Engenharia Informática",
    "uvigo": "Universidade de Vigo, Campus de Ourense, Ourense (Espanha)",
    "associate": "Técnico Superior em Administração de Redes e Sistemas Informáticos",
    "rodeira": "IES de Rodeira, Cangas do Morrazo (Espanha)",
    "courses": "Cursos e certificações",
    "angular": "Curso de introdução ao Angular 6",
    "vitae": "Vitae Consultores, A Coruña (Espanha)",
    "scrum": "Curso de Scrum com certificado Scrum Manager Expert",
    "toeic": "Certificado de inglés TOEIC B2",
    "multimedia": "Multimedia School, Ourense (Espanha)",
    "technical": "Competências técnicas",
    "programming": "Programação",
    "front_end": "Front end",
    "languages": "Línguas",
    "frameworks_libraries": "Frameworks e bibliotecas",
    "back_end": "Back end",
    "transversal": "Transversal",
    "methodologies": "Metodologias",
    "spanish": "Espanhol: ★★★★★★",
    "galician": "Galego: ★★★★★★",
    "english": "Inglês: ★★★★★☆",
    "portuguese": "Português: ★★★★★☆",
    "french": "Francês: ★★★☆☆☆",
    "polish": "Polaco: ★★☆☆☆☆",
    "finnish": "Finlandês: ★☆☆☆☆☆",
    "page": "Página:",
    "code": "Código:",
    "screenshots": "Capturas de ecrã",
    "video": "Vídeo",
    "oppi_header": "App web para praticar a flexão de palavras em finlandês",
    "oppi0": "Oppi é uma app web que criei para melhorar a minha experiência de aprendizagem da flexião de palavras em finlandês. Foi desenvolvida em Angular e utiliza a IndexedDB para armacenar dados.",
    "oppi1": "O seu funcionamento é simples: primeiro procura uma palavra no input de pesquisa e, a seguir, a app gera uma tabela que tem de ser preenchida. Despois de o fazer, carrega o botão de verificação e a app destaca as palavras certas e erradas com cores diferentes. Também tem a opção de ver la flexão da palavra directamente e a opção de obter uma palavra aleatória. Tem un tutorial que explica melhor o funcionamento dentro da app que aparece a primeira vez que é utilizada.",
    "oppi2": "Criei-a como PWA para que possa ser instalada no telemóvel como se fosse uma app nativa. Como não tem back end para ir buscar as palavras (está alojado em GitHub Pages), precisa de ter todas as palavras de antemão para funcionar. Para isso, a primeira vez que carrega no browser, descarrega um ficheiro com cerca de 58000 palavras que extraí do Wiktionary utilizando um script em Python, e guarda essas palavras na IndexedDB, para não ter de as descarregar de novo sempre que é utilizado. Tendo isso em conta, a primeira vez que carrega demora vários segundos a facê-lo, pelo que é preciso ter paciência.",
    "piollo_header": "Cliente web para o módulo da câmara da Raspberry Pi",
    "piollo0": "Piollo é um cliente web para o módulo da câmara da Raspberry Pi que usa web sockets para transmitir vídeo. O front end foi desenvolvido em AngularJS, mas quero mudar po outra tecnologia no futuro, e o back end foi desenvolvido de raiz em Python usando o módulo picamera de Python. Não utilizei nenhuma framework web porque achei interessante fazê-lo sozinho para aprender a utilizar sockets nesta linguagem.",
    "serkis": "keypointextractor e serkisplugin",
    "serkis_header": "Tracking de movimentos faciais e controlo de movimento de um modelo 3D em Blender",
    "serkis0": "Este é o meu projeto de final de licenciatura. É composto por dois subprojetos: o primeiro, keypointextractor, é um programa que extrai pontos-chave faciais de um vídeo e o segundo, serkisplugin, é um plugin para o Blender que usa los pontos extraídos para animar um modelo 3D de um rosto.",
    "serkis1": "Para este projeto, utilizei Python com as bibliotecas dlib, OpenCV e Qt para o keypointextractor e Python com a API do Blender para o serkisplugin.",
    "grissonne_header": "Versão web do Carcassonne",
    "grissonne0": "Versão web do Carcassonne, un popular jogo de tabuleiro, criado com o objetivo de aprender React. Foi criado para ser jogado em ecrãs grandes, não foi feito para ser aberto em dispositivos móveis.",
    "new": "Novo!",
    "cvscode_modal": "Criei uma nova versão do meu CV web que imita o estilo do vscode, chama-se CVscode. Foi feito para ser aberto em browsers de computador, por isso, se estiveres em um computador, considera experimentá-lo.",
    "cvscode_open": "Ir para o CVscode",
    "stay_here": "Ficar aqui",
    "go_to_cvscode": "Ir para o CVscode, a nova versão desta web",
    "cvscode": "CVscode",
    "cvscode_header": "O meu CV web no estilo do vscode",
    "cvscode0": "É feito em React e tem alguns dos componentes do vscode, como os separadores ou o explorador de ficheiros. Ainda não está terminado, penso adicionar mais coisas no futuro.",
    "warning": "Aviso",
    "warning_mobile": "Esta página não foi criada para ser mostrada num dispositivo móvel, deve ser aberta num browser de computador.",
    "go_mobile": "Ir para a versão móvel",
    "gym": "Gym",
    "gym_header": "App web para acompanhar rotinas de treino",
    "gym0": "Gym é uma app web que criei para acompanhar a minha rotina de treino. Foi desenvolvida em Angular e utiliza a IndexedDB para armacenar dados e o service worker para controlar temporizadores e notificações.",
    "gym1": "Podes definir treinos com exercícios e executá-los, con temporizadores para o tempo de descanso. Tem também um cronómetro e um temporizador global.",
    "gym2": "Foi criada para ser usada em dispositivos móveis e pode ser instalada como PWA."
}
